Hey @fmunozmiranda 
It looks like this is fixed with `v1.1.6-beta`. Thanks!

When I create a new object:
```
  # meraki_organizations_policy_objects.test_policy_object will be created
  + resource "meraki_organizations_policy_objects" "test_policy_object" {
      + category         = "network"
      + cidr             = "192.168.20.0/24"
      + created_at       = (known after apply)
      + fqdn             = (known after apply)
      + group_ids        = (known after apply)
      + id               = (known after apply)
      + ip               = (known after apply)
      + mask             = (known after apply)
      + name             = "Test3 Policy Object Terraform"
      + network_ids      = (known after apply)
      + organization_id  = "<ORG_ID>"
      + policy_object_id = (known after apply)
      + type             = "cidr"
      + updated_at       = (known after apply)
    }
```

State after apply:
```
terraform state show meraki_organizations_policy_objects.test_policy_object
# meraki_organizations_policy_objects.test_policy_object:
resource "meraki_organizations_policy_objects" "test_policy_object" {
    category         = "network"
    cidr             = "192.168.20.0/24"
    created_at       = "2025-07-10T07:14:29Z"
    id               = "3969360121573671502"
    name             = "Test3 Policy Object Terraform"
    organization_id  = "<ORG_ID>"
    policy_object_id = "3969360121573671501"
    type             = "cidr"
    updated_at       = "2025-07-10T07:14:29Z"
}
```

Subsequent `terraform plan` and `terraform apply` runs do not want to change the object in any way.

I see only one possible cosmetic issue. When I made a modification in the resource and run `terraform apply`:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # meraki_organizations_policy_objects.test_policy_object will be updated in-place
  ~ resource "meraki_organizations_policy_objects" "test_policy_object" {
      ~ created_at       = "2025-07-10T07:17:47Z" -> (known after apply)
      + fqdn             = (known after apply)
      + group_ids        = (known after apply)
      ~ id               = "3969360121573671502" -> (known after apply)
      + ip               = (known after apply)
      + mask             = (known after apply)
      ~ name             = "Test3 Policy Object Terraform" -> "Test3 Mod Policy Object Terraform"
      + network_ids      = (known after apply)
      ~ updated_at       = "2025-07-10T07:17:47Z" -> (known after apply)
        # (5 unchanged attributes hidden)
    }
```
Is the change indication for `id` expected?
